tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"
tap "heroku/brew"

# Comand line tools
brew "act" # Run GitHub Actions locally
brew "asdf" # Version manager
brew "rbenv" # Ruby version
brew "neovim" # Text editor
brew "gh" # GitHub CLI
brew "ripgrep" # ?
brew "gnu-sed" # ?
brew "fd" # ?
brew "fzf" # Search tool
brew "the_silver_searcher" # ?
brew "jesseduffield/lazygit/lazygit" # Git GUI
brew "jesseduffield/lazydocker/lazydocker" # Docker GUI
brew "zellij" # Terminal multiplexer
brew "antigen" # Zsh plugin manager
brew "diff-so-fancy" # Pretty git diff
brew "caarlos0/tap/svu" # Semantic Versioning util
brew "mcfly" # Better history
brew "zoxide" # Better cd
brew "heroku" # Heroku CLI

# App stuff
brew "yarn" # JS package
brew "imagemagick" # Image manipulation
brew "ffmpeg" # Video manipulation
brew "postgresql@15" # Database
