tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"
tap "heroku/brew"

# Lazyvim dependencies
brew "fd" # find files
brew "ripgrep" # fast grep
brew "gnu-sed" #  search and replace

# Command line tools
brew "act" # Run GitHub Actions locally
brew "asdf" # Version manager
brew "eza" # Modernized `ls`
brew "neovim" # Text editor
brew "gh" # GitHub CLI
brew "fzf" # Search tool
brew "the_silver_searcher" # Faster fzf
brew "jesseduffield/lazygit/lazygit" # Git GUI
brew "jesseduffield/lazydocker/lazydocker" # Docker GUI
brew "zellij" # Terminal multiplexer
brew "antigen" # Zsh plugin manager
brew "diff-so-fancy" # Pretty git diff
brew "caarlos0/tap/svu" # Semantic Versioning util
brew "mcfly" # Better history
brew "zoxide" # Better cd
brew "heroku" # Heroku CLI
brew "bat" # Better cat

# App stuff
brew "yarn" # JS package
brew "vips" # Image manipulation
brew "ffmpeg" # Video manipulation
brew "postgresql@15" # Database
brew "libpq", link: :force # Postgres lib for gem compilation and pg_dump
brew "openssl@1.1" # OpenSSL for gem compilation

# Nerd fonts
cask "font-jetbrains-mono-nerd-font"
